Revit 2027 API
ExternallyTaggedNonBRepUsage Enumeration
 The ways in which an ExternallyTaggedNonBRep can be used in Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ExternallyTaggedNonBRepUsage
Public Enumeration ExternallyTaggedNonBRepUsage
public enum class ExternallyTaggedNonBRepUsage
type ExternallyTaggedNonBRepUsage
Members
Member name | Value | Description
Displayable | 0 |  Can be used for display purposes.
Referenceable | 3 |  Can be dimensioned to as well as snapped to.
Selectable | 1 |  Can be selected as well as displayed.
Snappable | 2 |  Can be snapped to as well as selected.
See Also
Reference
Autodesk.Revit.DB Namespace